Repository: nacyot/omegat-12factor
Catalog: omegat/project_save.tmx
Source language: en
Languages: ko

source: ## II. Dependencies ### Explicitly declare and isolate dependencies
ko: ## 2. 의존성 ### 의존성의 명시적인 선언과 분리

source: ## IV. Backing Services ### Treat backing services as attached resources
ko: ## 4. 백엔드 서비스 ### 백엔드 서비스를 붙여둔 리소스로 다루기

source: ## VII. Port binding ### Export services via port binding
ko: ## 7. 포트 바인딩 ### 포트 바인딩으로 서비스 공개하기

source: ## XI. Logs ### Treat logs as event streams
ko: ## 11. 로그 ### 로그를 이벤트 스트림으로 다루기

source: ## XII. Admin processes ### Run admin/management tasks as one-off processes
ko: ## 12. 관리 프로세스 ### 관리 테스크를 한 번만 사용하는 프로세스로 실행하기

source: ## [I. Codebase](/codebase) ### One codebase tracked in revision control, many deploys
ko: ## [1. 코드 베이스](/codebase) ### 버전 관리되는 하나의 코드 베이스와 다수의 배포

source: ## [II. Dependencies](/dependencies) ### Explicitly declare and isolate dependencies
ko: ## [2. 의존성](/dependencies) ### 의존성의 명시적인 선언과 분리

source: ## [III. Config](/config) ### Store config in the environment
ko: ## [3. 설정](/config) ### 환경 변수에 설정 저장하기

source: ## [IV. Backing Services](/backing-services) ### Treat backing services as attached resources
ko: ## [4. 백엔드 서비스](/backing-services) ### 백엔드 서비스를 붙여둔@@@ 리소스로 다루기

source: ## [IX. Disposability](/disposability) ### Maximize robustness with fast startup and graceful shutdown
ko: ## [9. 일회용성](/disposability) ### 빠른 실행과 깔금한 종료를 통해 견고성 최대화하기

source: ## [V. Build, release, run](/build-release-run) ### Strictly separate build and run stages
ko: ## [5. 빌드, 릴리즈, 실행](/build-release-run) ### 빌드와 실행 단계 엄격하게 분리하기

source: ## [VI. Processes](/processes) ### Execute the app as one or more stateless processes
ko: ## [6. 프로세스](/processes) ### 어플리케이션을 하나나 그 이상의 상태 없는 프로세스로 실행하기

source: ## [VII. Port binding](/port-binding) ### Export services via port binding
ko: ## [7. 포트 바인딩](/port-binding) ### 포트 바인딩으로 서비스 공개하기

source: ## [VIII. Concurrency](/concurrency) ### Scale out via the process model
ko: ## [8. 병행성](/concurrency) ### 프로세스 모델을 스케일 아웃하기

source: ## [X. Dev/prod parity](/dev-prod-parity) ### Keep development, staging, and production as similar as possible
ko: ## [10. 개발 / 배포 일치](/dev-prod-parity) ### 개발, 스테이징, 배포를 최대한 일치시키기

source: ## [XI. Logs](/logs) ### Treat logs as event streams
ko: ## [11. 로그](/logs) ### 로그를 이벤트 스트림으로 다루기

source: ## [XII. Admin processes](/admin-processes) ### Run admin/management tasks as one-off processes
ko: ## [12. 관리 프로세스](/admin-processes) ### 관리 테스트를 한 번만 사용하는 프로세스로 실행하기

source: * **Minimize divergence** between development and production, enabling **continuous deployment** for maximum agility;
ko: * 개발 환경과 배포 환경의 **차이를 최소화**하고, 에자일리티(agility)를 최대화하는 **계속적 배포**를 가능하게 한다.

source: * And can **scale up** without significant changes to tooling, architecture, or development practices.
ko: * 도구, 아키텍쳐, 개발적 요소들의 큰 변화 없이 스케일 아웃을 가능하게 한다.

source: * Are suitable for **deployment** on modern **cloud platforms**, obviating the need for servers and systems administration;
ko: * 현대적인 **클라우드 플랫폼**에서 배포하는데 적합하시며 서버 관리와 시스템 관리를 피할 수 있게 한다.

source: * Have a **clean contract** with the underlying operating system, offering **maximum portability** between execution environments;
ko: * 어플리케이션 배포의 기반이 되는 운영체제의 의존관계를 명확하게 하고, 실행 환경 간의 **이동성을 최대화**한다.

source: * Running a console (also known as a [REPL](http://en.wikipedia.org/wiki/Read-eval-print_loop) shell) to run arbitrary code or inspect the app's models against the live database.
ko: * 임의의 코드를 실행하거나 데이터베이스에 대한 어플리케이션의 모델을 확인하기 위한 콘솔([REPL](http://en.wikipedia.org/wiki/Read-eval-print_loop)이라고도 한다)

source: * Running database migrations (e.g. `manage.py syncdb` in Django, `rake db:migrate` in Rails).
ko: * 데이터베이스 마이그레이션(예를 들면 Django의 `manage.py sincdb`나 레일스의 `rake db`)

source: * Running one-time scripts committed into the app's repo (e.g. `php scripts/fix_bad_records.php`).
ko: * 어플리케이션 저장소에 커밋된 한 번만 실행하기 위한 스크립트.(예를 들어 `php scripts/fix_bad_records.php`)

source: * Use **declarative** formats for setup automation, to minimize time and cost for new developers joining the project;
ko: * 셋업 자동화에 **선언적인** 포맷을 사용해서 새로운 개발자가 프로젝트에 참여하는데 드는 시간과 비용을 최소화한다.

source: **A twelve-factor app never relies on implicit existence of system-wide packages.** It declares all dependencies, completely and exactly, via a *dependency declaration* manifest.
ko: **Twelve-Factor App은 결코 암묵적으로 시스템 전체에 설치된 패키지가 존재한다고 전제하지 않는다.** 모든 의존 관계는 *의존 관계 선언 manifest*를 통해서 완전하고 정확하고 선언해야한다.

source: **The code for a twelve-factor app makes no distinction between local and third party services.** To the app, both are attached resources, accessed via a URL or other locator/credentials stored in the [config](/config).
ko: ** Twelve-Factor App의 코드는 로컬 서비스와 써드 파티 서비스의 차이를 구분하지 않는다. 어플리케이션 입장에서 보자면 어느 쪽이건 붙여진 리소스로써 [설정](/config)에 저장된 URL이나 기타 로케터/인증 정보로 접근 가능하다.

source: **The twelve-factor app is completely self-contained** and does not rely on runtime injection of a webserver into the execution environment to create a web-facing service.
ko: **Twelve-Factor App은 철저히 스스로 완결되며** 웹에 공개되는 서비스를 만들기 위한 컨테이너가 실행환경에 웹서버 런타임을 주입하는 것에 의존하지 않는다.

source: *Logs* provide visibility into the behavior of a running app.
ko: *Logs*는 실행중인 어플리케이션에서 일어나는 일들을 보여준다.

source: A *backing service* is any service the app consumes over the network as part of its normal operation.
ko: 백엔드 서비스란 어플리케이션이 실행되는 가운데 네트워크를 통해서 사용될 수 있는 모든 서비스를 일컫는다.

source: A [deploy](/codebase) of the twelve-factor app should be able to swap out a local MySQL database with one managed by a third party (such as [Amazon RDS](http://aws.amazon.com/rds/)) without any changes to the app's code.
ko: Twelve-Factor App의 [배포](/codebase)는 어플리케이션 코드의 변경 없이도 로컬에서 관리되는 Mysql 데이터베이스와 써드 파티에서 관리되는 서비스(예를 들어 [Amazon RDS](http://aws.amazon.com/rds/))를 변경할 수 있어야합니다.

source: Admin code must ship with application code to avoid synchronization issues.
ko: 관리용 코드는 동기 문제를 피하기 위해 어플리케이션과 함께 배포되어야한다.

source: Background ==========
ko: 배경 ==========

source: Backing services like the database are traditionally managed by the same systems administrators as the app's runtime deploy.
ko: 과거에 데이터베이스와 같은 백엔드 서비스는 배포된 어플리케이션과 같은 시스템 관리자에 의해서 관리되었다.

source: Each distinct backing service is a *resource*.
ko: 각각의 벡엔드 서비스는 *리소스*입니다.

source: Even C has [Autoconf](http://www.gnu.org/s/autoconf/) for dependency declaration, and static linking can provide dependency isolation.
ko: 심지어 C에서도 [Autoconf](http://www.gnu.org/s/autoconf/)는 의존성 선언을 지원하고, 정적 링크를 통해서 의존성 분리를 실현할 수 있다.

source: Examples include shelling out to ImageMagick or `curl`.
ko: 예를 들어 어플리케이션에서 ImageMagick이나 `curl` 같은 툴을 이용하는 경우가 있다.

source: For example, PHP apps might run as a module inside [Apache HTTPD](http://httpd.apache.org/), or Java apps might run inside [Tomcat](http://tomcat.apache.org/).
ko: 예를 들어 PHP 어플리케이션은 [Apache HTTPD](httpd.apache.org/) 내부의 모듈로 실행되기도 하며, Java 어플리케이션은 [Tomcat](http://tomcat.apache.org/) 안에서 실행되기도 한다.

source: For example, [Gem Bundler](http://gembundler.com/) for Ruby offers the `Gemfile` manifest format for dependency declaration and `bundle exec` for dependency isolation.
ko: 예를 들어 루비에서 사용되는 [Gem Bundler](http://gembundler.com/)는 의존성 정의를 위한 `Gemfile`이라는 선언 형식을 지원하며 `bundle exec`를 통해서 의존성을 분리한다.

source: For example, a MySQL database is a resource;
ko: 예를 들어 Mysql 데이터베이스는 하나의 리소스입니다.

source: For example, if the Ruby web process uses the command `bundle exec thin start`, then a database migration should use `bundle exec rake db:migrate`.
ko: 예를 들어 루비 웹 프로세스가 `bundle exec thin start`로 실행된다면 데이터베이스 마이그레이션은 `bundle exec rake db:migrate` 명령어를 통해서 실행되어야한다.

source: For example, the build command for Ruby/Bundler is `bundle install`, while for Clojure/[Leiningen](https://github.com/technomancy/leiningen#readme) it is `lein deps`.
ko: 예를 들어 루비 번들러의 빌드 명령어는 `bundle install`이며 클로저(Clojure)의 Leiningen에서는 `lein deps` 명령어가 사용된다.

source: Furthermore, it uses a *dependency isolation* tool during execution to ensure that no implicit dependencies "leak in" from the surrounding system.
ko: 더욱이 실행중에 *의존성 분리* 툴을 사용해 @@@

source: If the app needs to shell out to a system tool, that tool should be vendored into the app.
ko: 어플리케이션에서 시스템 툴을 사용하는 경우엔 그 툴이 어플리케이션에 포함되어야한다.

source: In a local deploy, developers invoke one-off admin processes by a direct shell command inside the app's checkout directory.
ko: 로컬 배포에서 개발자는 한 번만 사용하는 관리 프로세스를 어플리케이션을 체크아웃한 디렉토리 안에서 쉘 명령어로서 직접 실행한다.

source: In a local development environment, the developer visits a service URL like `http://localhost:5000/` to access the service exported by their app.
ko: 로컬 개발환경에서 개발자는 어플리케이션에 의해 공개된 서비스에 접근하기 위해 `http://localhost:5000`와 같은 서비스 URL에 접근합니다.

source: In a production deploy, developers can use ssh or other remote command execution mechanism provided by that deploy's execution environment to run such a process.
ko: 실제 배포 과정에서 개발자는 SSH나 배포 환경이 제공하는 다른 리모트 커맨드 실행 방법을 사용해 해당하는 프로세스를 실행한다.

source: In addition to these locally-managed services, the app may also have services provided and managed by third parties.
ko: 또한 이러한 로컬에서 관리되는 서비스와 더불어 서드 파티에서 제공하고 관리되는 서비스도 있다.

source: In both cases, only the resource handle in the config needs to change.
ko: 두 사례 모두 변경이 필요한 부분은 설정의 리소스 핸들 부분입니다.

source: In deployment, a routing layer handles routing requests from a public-facing hostname to the port-bound web processes.
ko: 배포 환경에서는 라우팅 레이어가 외부에 공개된 호스트 이름으로부터 내부의 포트에 바인딩된 웹 프로세스에 요청을 라우트합니다.

source: In server-based environments they are commonly written to a file on disk (a "logfile");
ko: 일반적으로 서버 기반 환경 위에서 로그는 파일 시스템("로그 파일")에 쓰여진다.

source: In the modern era, software is commonly delivered as a service: called *web apps*, or *software-as-a-service*. The twelve-factor app is a methodology for building software-as-a-service apps that:
ko: 현대에 소프트웨어는 서비스로 제공되며 *웹 어플리케이션(web apps)*이나 *Soft as a Service*라고 이야기되곤 합니다. The Twelve-factor App은 Software as a service을 작성하는 방법론을 담고 있습니다.

source: In, Python there are two separate tools for these steps -- [Pip](http://www.pip-installer.org/en/latest/) is used for declaration and [Virtualenv](http://www.virtualenv.org/en/latest/) for isolation.
ko: 파이썬에서는 이러한 분리가 두 단계에 걸쳐서 이루어진다. [Pip](http://www.pip-installer.org/en/latest/)은 의존성 선언에 사용되며 [Virtualenv](http://www.virtualenv.org/en/latest/)는 의존성 분리에 사용된다.

source: Introduction ============
ko: 시작하며 ============

source: Libraries installed through a packaging system can be installed system-wide (known as "site packages") or scoped into the directory containing the app (known as "vendoring" or "bundling").
ko: 패키지 관리 시스템을 통한 라이브러리 설치는 시스템 전체("site packages"라고 한다)에 설치하는 경우와 어플리케이션이 포함된 디레토리 범위에서 설치되는 경우가 있다("vendoring"이나 "bundling"라고 한다).

source: Likewise, a Python program using Virtualenv should use the vendored `bin/python` for running both the Tornado webserver and any `manage.py` admin processes.
ko: 마찬가지로 Virtualenv를 사용하는 파이썬 프로그램의 경우 가상환경 내의`bin/python`을 Tornado 웹서버를 비롯해 모든 `manage.py`를 사용하는 명령어에 마찬가지로 사용해야한다.

source: Likewise, a local SMTP server could be swapped with a third-party SMTP service (such as Postmark) without code changes.
ko: 마찬가지로 로컬에서 관리되는 SMTP 서버도 코드 변경없이 Postmark와 같은 써드파티 SMTP 서비스와 교체될 수 있어야합니다.

source: Logs are the [stream](http://adam.heroku.com/past/2011/4/1/logs_are_streams_not_files/) of aggregated, time-ordered events collected from the output streams of all running processes and backing services.
ko: 로그는 모든 실행중인 프로세스와 백엔드 서비스에서 시간순으로 정렬되고 쌓여있는 이벤트를 수집하는 스트림이다.

source: Logs in their raw form are typically a text format with one event per line (though backtraces from exceptions may span multiple lines).
ko: 일반적으로 어플리케이션이 직접 생성한 로그는 한 줄에 하나의 이벤트를 기록하고 있는 텍스)

source: Most languages provide a REPL by running the interpreter without any arguments (e.g. `python` or `erl`) or in some cases have a separate command (e.g. `irb` for Ruby, `rails console` for Rails).
ko: 많은 언어에서는 별다른 인자없이 인터프리터를 실행하면 REPL을 실행할 수 있다. 혹은 루비의 `irb`나 `rails console`과 같이 별도의 명령어를 제공하기도 한다.

source: Most programming languages offer a packaging system for distributing support libraries, such as [CPAN](http://www.cpan.org/) for Perl or [Rubygems](http://rubygems.org/) for Ruby.
ko: 대부분의 프로그래밍 언어는 Perl의 [CPAN](http://www.cpan.org/)이나 루비의 [루비젬](http://rubygems.org/)과 같이 의존 라이브러리 관리를 위한 패키지 관리 시스템을 제공한다.

source: No matter what the toolchain, dependency declaration and isolation must always be used together -- only one or the other is not sufficient to satisfy twelve-factor.
ko: 어떤 툴을 사용하건 간에 의존관계 선언과 분리는 항상 함께 사용되어야 한다. 어느 한 쪽만을 사용하는 것은 twelve factor의 조건을 만족하지 않는다.

source: One benefit of explicit dependency declaration is that it simplifies setup for developers new to the app.
ko: 의존성을 명시적으로 선언하면 새로운 프로그래머가 어플리케이션 개발에 참여할 때 개발 환경을 쉽게 구성할 수 있다.

source: One-off admin processes should be run in an identical environment as the regular [long-running processes](/processes) of the app.
ko: 한 번만 실행되는 프로세스들은 일반적으로 [장기간 실행되는 프로세스들](/processes)과 같은 환경에서 실행되어야한다.

source: Separately, developers will often wish to do one-off administrative or maintenance tasks for the app, such as:
ko: 이와는 별개로 개발자는 관리나 유지보수 목적으로 한번만 실행되는 태스크를 실행하고 싶을 수 있다. 예를 들면 아래와 같은 것들이 있다.

source: The [process formation](/concurrency) is the array of processes that are used to do the app's regular business (such as handling web requests) as it runs.
ko: [프로세스 포메이션](/concurrency)이란 어플리케이션을 실행할 때 통상적인 역할(웹 리퀘스트 처리 등)을 다루기 위한 프로세스들을 이야기한다.

source: The contributors to this document have been directly involved in the development and deployment of hundreds of apps, and indirectly witnessed the development, operation, and scaling of hundreds of thousands of apps via our work on the [Heroku](http://www.heroku.com/) platform.
ko: 이 문서의 작성자는 직접적으로 수백개의 어플리케이션의 개발과 배포에 참가했으며 [히로쿠(Heroku)](http://www.heroku.com/) 플랫폼에서 일하면서 수천개 어플리케이션의 개발(development), 운용(operation), 스케일(scaling)에 간접적으로 참여했다.

source: The full and explicit dependency specification is applied uniformly to both production and development.
ko: 완전하고 명시적은 의존성 선언은 배포 환경과 개발 환경 모두에 마찬가지로 적용한다.

source: The new developer can check out the app's codebase onto their development machine, requiring only the language runtime and dependency manager installed as prerequisites.
ko: 새로운 프로그래머는 사용하는 언어의 런타임과 의존성 관리 도구만 설치되어있다면 어플리케이션의 코드베이스를 개발 머신에 체크아웃할 수 있다.

source: The same [dependency isolation](/dependencies) techniques should be used on all process types.
ko: 모든 프로세스 타입들에 대해서 같은 [의존성 분리](/dependencies) 기법들이 사용되어야한다.

source: The twelve-factor methodology can be applied to apps written in any programming language, and which use any combination of backing services (database, queue, memory cache, etc).
ko: The Twelve-Factor 방법론은 어떤 프로그래밍 언어로 쓰여진 어플리케이션에도 적용가능하며, 어떤 백엔드 서비스(데이터베이스, 큐, 메모리 캐시 등등)에도 적용될 수 있습니다.

source: The web app **exports HTTP as a service by binding to a port**, and listening to requests coming in on that port.
ko: 웹 어플리케이션은 ** 포트 바인딩을 통해서 HTTP를 서비스로 공개하며 이 포트에 오는 요청을 기다린다.

source: They run against a [release](/build-release-run), using the same [code](/code) and [config](/config) as any process run against that release.
ko: 이러한 프로세스들은 특정 [릴리스](/build-release-run)에 대해서 실행되어야 하면 이 릴리스에 대해서 실행되는 모든 프로세스와 같은 [코드](/code)와 [설정](/config)을 사용해야한다.

source: They will be able to set up everything needed to run the app's code with a deterministic *build command*.
ko: 프로그래머는 정해진 빌드 커맨드 하나로 어플리케이션 개발에 필요한 모든 설정을 할 수 있다.

source: This document synthesizes all of our experience and observations on a wide variety of software-as-a-service apps in the wild.
ko: 이 문서는 현실에서 다양하게 사용되는 software-as-a-service 앱 세계에 대한 우리의 모든 경험과 관찰을 집약한 책입니다.

source: Twelve-factor apps also do not rely on the implicit existence of any system tools.
ko: 또한 Twelve-Factor App은 어떠한 시스템 툴에도 의존하지 않는다.

source: Twelve-factor strongly favors languages which provide a REPL shell out of the box, and which make it easy to run one-off scripts.
ko: Twelve-factor는 특별한 설정없이도 REPL을 사용할 수 있는 언어를 선호한다. 이는 1번만 사용하는 스크립트를 실행하기 쉽기 때문이다.

source: Web apps are sometimes executed inside a webserver container.
ko: 웹 어플리케이션은 웹 서버 컨테이너 안에서 실행되기도 한다.

source: While these tools may exist on many or even most systems, there is no guarantee that they will exist on all systems where the app may run in the future, or whether the version found on a future system will be compatible with the app.
ko: 이러한 툴들은 대개 시스템 기반으로 설치되는 경우가 많은데, 미래에 이 어플리케이션을 돌릴 모든 시스템에 툴이 설치되어있는지 알 수 없으며 설치되어있다고 한들 어플리케이션과 호환되는 버전이라는 보장은 어디에도 업스다.

source: but this is only an output format.
ko: 하지만 이는 한 가지 출력 방법일 뿐이다.
